-- MySQL dump 10.13  Distrib 5.6.24, for Win64 (x86_64)
--
-- Host: 127.0.0.1    Database: quran-bdd
-- ------------------------------------------------------
-- Server version	5.6.21

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `sura`
--

DROP TABLE IF EXISTS `sura`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `sura` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `titre` varchar(255) COLLATE utf8_unicode_ci NOT NULL,
  `debut` int(11) NOT NULL,
  `nb_ayas` int(11) NOT NULL,
  `ordre_revelation` int(11) NOT NULL,
  `lieu_revelation` int(11) DEFAULT NULL,
  PRIMARY KEY (`id`),
  KEY `FK_2D48306FD1492E56` (`lieu_revelation`),
  CONSTRAINT `FK_2D48306FD1492E56` FOREIGN KEY (`lieu_revelation`) REFERENCES `lieu_revelation` (`id`) ON DELETE CASCADE ON UPDATE CASCADE
) ENGINE=InnoDB AUTO_INCREMENT=115 DEFAULT CHARSET=utf8 COLLATE=utf8_unicode_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `sura`
--

LOCK TABLES `sura` WRITE;
/*!40000 ALTER TABLE `sura` DISABLE KEYS */;
INSERT INTO `sura` VALUES (1,'الفاتحة',0,7,5,1),(2,'البقرة',7,286,87,2),(3,'آل عمران',293,200,89,2),(4,'النساء',493,176,92,2),(5,'المائدة',669,120,112,2),(6,'الأنعام',789,165,55,1),(7,'الأعراف',954,206,39,1),(8,'الأنفال',1160,75,88,2),(9,'التوبة',1235,129,113,2),(10,'يونس',1364,109,51,1),(11,'هود',1473,123,52,1),(12,'يوسف',1596,111,53,1),(13,'الرعد',1707,43,96,2),(14,'ابراهيم',1750,52,72,1),(15,'الحجر',1802,99,54,1),(16,'النحل',1901,128,70,1),(17,'الإسراء',2029,111,50,1),(18,'الكهف',2140,110,69,1),(19,'مريم',2250,98,44,1),(20,'طه',2348,135,45,1),(21,'الأنبياء',2483,112,73,1),(22,'الحج',2595,78,103,2),(23,'المؤمنون',2673,118,74,1),(24,'النور',2791,64,102,2),(25,'الفرقان',2855,77,42,1),(26,'الشعراء',2932,227,47,1),(27,'النمل',3159,93,48,1),(28,'القصص',3252,88,49,1),(29,'العنكبوت',3340,69,85,1),(30,'الروم',3409,60,84,1),(31,'لقمان',3469,34,57,1),(32,'السجدة',3503,30,75,1),(33,'الأحزاب',3533,73,90,2),(34,'سبإ',3606,54,58,1),(35,'فاطر',3660,45,43,1),(36,'يس',3705,83,41,1),(37,'الصافات',3788,182,56,1),(38,'ص',3970,88,38,1),(39,'الزمر',4058,75,59,1),(40,'غافر',4133,85,60,1),(41,'فصلت',4218,54,61,1),(42,'الشورى',4272,53,62,1),(43,'الزخرف',4325,89,63,1),(44,'الدخان',4414,59,64,1),(45,'الجاثية',4473,37,65,1),(46,'الأحقاف',4510,35,66,1),(47,'محمد',4545,38,95,2),(48,'الفتح',4583,29,111,2),(49,'الحجرات',4612,18,106,2),(50,'ق',4630,45,34,1),(51,'الذاريات',4675,60,67,1),(52,'الطور',4735,49,76,1),(53,'النجم',4784,62,23,1),(54,'القمر',4846,55,37,1),(55,'الرحمن',4901,78,97,2),(56,'الواقعة',4979,96,46,1),(57,'الحديد',5075,29,94,2),(58,'المجادلة',5104,22,105,2),(59,'الحشر',5126,24,101,2),(60,'الممتحنة',5150,13,91,2),(61,'الصف',5163,14,109,2),(62,'الجمعة',5177,11,110,2),(63,'المنافقون',5188,11,104,2),(64,'التغابن',5199,18,108,2),(65,'الطلاق',5217,12,99,2),(66,'التحريم',5229,12,107,2),(67,'الملك',5241,30,77,1),(68,'القلم',5271,52,2,1),(69,'الحاقة',5323,52,78,1),(70,'المعارج',5375,44,79,1),(71,'نوح',5419,28,71,1),(72,'الجن',5447,28,40,1),(73,'المزمل',5475,20,3,1),(74,'المدثر',5495,56,4,1),(75,'القيامة',5551,40,31,1),(76,'الانسان',5591,31,98,2),(77,'المرسلات',5622,50,33,1),(78,'النبإ',5672,40,80,1),(79,'النازعات',5712,46,81,1),(80,'عبس',5758,42,24,1),(81,'التكوير',5800,29,7,1),(82,'الإنفطار',5829,19,82,1),(83,'المطففين',5848,36,86,1),(84,'الإنشقاق',5884,25,83,1),(85,'البروج',5909,22,27,1),(86,'الطارق',5931,17,36,1),(87,'الأعلى',5948,19,8,1),(88,'الغاشية',5967,26,68,1),(89,'الفجر',5993,30,10,1),(90,'البلد',6023,20,35,1),(91,'الشمس',6043,15,26,1),(92,'الليل',6058,21,9,1),(93,'الضحى',6079,11,11,1),(94,'الشرح',6090,8,12,1),(95,'التين',6098,8,28,1),(96,'العلق',6106,19,1,1),(97,'القدر',6125,5,25,1),(98,'البينة',6130,8,100,2),(99,'الزلزلة',6138,8,93,2),(100,'العاديات',6146,11,14,1),(101,'القارعة',6157,11,30,1),(102,'التكاثر',6168,8,16,1),(103,'العصر',6176,3,13,1),(104,'الهمزة',6179,9,32,1),(105,'الفيل',6188,5,19,1),(106,'قريش',6193,4,29,1),(107,'الماعون',6197,7,17,1),(108,'الكوثر',6204,3,15,1),(109,'الكافرون',6207,6,18,1),(110,'النصر',6213,3,114,2),(111,'المسد',6216,5,6,1),(112,'الإخلاص',6221,4,22,1),(113,'الفلق',6225,5,20,1),(114,'الناس',6230,6,21,1);
/*!40000 ALTER TABLE `sura` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2015-08-08 17:59:05
